# Taps
tap "candid82/brew"
tap "derailed/k9s"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "jandedobbeleer/oh-my-posh"
tap "yqrashawn/goku"

# Bins
brew "aichat"
brew "zstd"
brew "webp"
brew "jpeg-xl"
brew "aom"
brew "bat"
brew "cmake"
brew "cmatrix"
brew "cowsay"
brew "diff-so-fancy"
brew "docker-compose"
brew "fzf"
brew "libavif"
brew "gd"
brew "gdk-pixbuf"
brew "gh"
brew "gnupg"
brew "go"
brew "netpbm"
brew "pango"
brew "librsvg"
brew "graphviz"
brew "htop"
brew "hugo"
brew "jq"
brew "openjdk"
brew "kotlin"
brew "krb5"
brew "lazygit"
brew "lsix"
brew "maven"
brew "minikube"
brew "neovim"
brew "node"
brew "nvm"
brew "p7zip"
brew "postgresql@14"
brew "pstree"
brew "pyenv"
brew "pyenv-virtualenv"
brew "python@3.10"
brew "python@3.11"
brew "python@3.9"
brew "ranger"
brew "ripgrep"
brew "spotify-tui"
brew "tealdeer"
brew "the_silver_searcher"
brew "thefuck"
brew "tilt"
brew "tmux"
brew "tree"
brew "vim", args: ["HEAD"]
brew "wget"
brew "youtube-dl"
brew "zoxide"
brew "derailed/k9s/k9s"
brew "hashicorp/tap/terraform"
brew "jandedobbeleer/oh-my-posh/oh-my-posh"

# Apps
cask "alacritty"
cask "flux"
cask "font-hack-nerd-font"
cask "hammerspoon"
cask "karabiner-elements"
cask "firefox"
cask "kitty"
cask "raycast"
cask "temurin"
cask "visual-studio-code"
cask "google-chrome"
cask "discord"
